from src.group import group_agg


def test_group_agg(my_list_dict_long):
    assert group_agg(my_list_dict_long, [
        "Перевод организации",
        "Перевод со счета на счет",
        "Перевод с карты на карту",
        "Открытие вклада",
    ]) == {'Перевод организации': 2, 'Перевод с карты на карту': 8, 'Открытие вклада': 5}

    assert group_agg(my_list_dict_long, [
        "Перевод организации",
        "Перевод со счета на счет",
        "Открытие вклада",
    ]) == {'Перевод организации': 2, 'Открытие вклада': 5}
